---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementBoundarySubface.SpatialBoundaryElement
source: html/332b209f-bf7d-7ebd-fc63-0463aaf89550.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface.SpatialBoundaryElement Property

Element that gave rise to this room face.

## Syntax (C#)
```csharp
public LinkElementId SpatialBoundaryElement { get; }
```